Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: To receive notifications on every push to a GitHub repository, add the Weblate Webhook in the repository settings (:guilabel:`Webhooks`) as shown on the image below:
sv: FÃ¶r att fÃ¥ aviseringar om varje push till ett GitHub-arkiv, lÃ¤gg till Weblate Webhook i arkivinstÃ¤llningarna (:guilabel:`Webhooks`) enligt bilden nedan:

source: The :guilabel:`Payload URL` consists of your Weblate URL appended by ``/hooks/github/``, for example for the Hosted Weblate service, this is ``https://hosted.weblate.org/hooks/github/``.
sv: :guilabel:`Payload URL` bestÃ¥r av din Weblate-URL med tillÃ¤gget ``/hooks/github/``. FÃ¶r Hosted Weblate-tjÃ¤nsten Ã¤r detta till exempel ``https://hosted.weblate.org/hooks/github/``.

source: You can leave other values at default settings (Weblate can handle both content types and consumes just the `push` event).
sv: Du kan lÃ¤mna andra vÃ¤rden pÃ¥ standardinstÃ¤llningarna (Weblate kan hantera bÃ¥da innehÃ¥llstyperna och anvÃ¤nder bara `push`-hÃ¤ndelsen).

source: Automatically receiving changes from Bitbucket
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n Bitbucket

source: Weblate has support for Bitbucket webhooks, add a webhook which triggers upon repository push, with destination to ``/hooks/bitbucket/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/bitbucket/``).
sv: Weblate har stÃ¶d fÃ¶r Bitbucket-webhooks. LÃ¤gg till en webhook som aktiveras vid push till repositoriet, med destinationen till URL:en ``/hooks/bitbucket/`` pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/bitbucket/``).

source: Automatically receiving changes from GitLab
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n GitLab

source: Weblate has support for GitLab hooks, add a project webhook with destination to ``/hooks/gitlab/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/gitlab/``).
sv: Weblate har stÃ¶d fÃ¶r GitLab-hooks. LÃ¤gg till en projektwebhook med destinationen ``/hooks/gitlab/`` URL pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/gitlab/``).

source: Troubleshooting
sv: FelsÃ¶kning

source: Check `GitLab webhook request history`_ if webhooks are delivered.
sv: Kontrollera `GitLab webhook request history`_ om webhooks levereras.

source: The response payload contains information about matched components.
sv: Svarets nyttolast innehÃ¥ller information om matchade komponenter.

source: Automatically receiving changes from Pagure
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n Pagure

source: Weblate has support for Pagure hooks, add a webhook with destination to ``/hooks/pagure/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/pagure/``). This can be done in :guilabel:`Activate Web-hooks` under :guilabel:`Project options`:
sv: Weblate har stÃ¶d fÃ¶r Pagure-hooks. LÃ¤gg till en webhook med destinationen ``/hooks/pagure/`` URL pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/pagure/``). Detta kan gÃ¶ras i :guilabel:`Aktivera webhooks` under :guilabel:`Projektalternativ`:

source: Automatically receiving changes from Azure Repos
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n Azure Repos

source: Weblate has support for Azure Repos webhooks, add a webhook for :guilabel:`Code pushed` event with destination to ``/hooks/azure/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/azure/``). This can be done in :guilabel:`Service hooks` under :guilabel:`Project settings`.
sv: Weblate har stÃ¶d fÃ¶r Azure Repos-webhooks. LÃ¤gg till en webhook fÃ¶r hÃ¤ndelsen :guilabel:`Code pushed` med destinationen ``/hooks/azure/`` URL pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/azure/``). Detta kan gÃ¶ras i :guilabel:`Service hooks` under :guilabel:`Project settings`.

source: `Web hooks in Azure DevOps manual <https://learn.microsoft.com/en-us/azure/devops/service-hooks/services/webhooks?view=azure-devops>`_
sv: `Web hooks i Azure DevOps-handboken <https://learn.microsoft.com/en-us/azure/devops/service-hooks/services/webhooks?view=azure-devops>`_

source: Automatically receiving changes from Gitea Repos
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n Gitea Repos

source: Weblate has support for Gitea webhooks, add a :guilabel:`Gitea Webhook` for :guilabel:`Push events` event with destination to ``/hooks/gitea/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/gitea/``). This can be done in :guilabel:`Webhooks` under repository :guilabel:`Settings`.
sv: Weblate har stÃ¶d fÃ¶r Gitea-webhooks. LÃ¤gg till en :guilabel:`Gitea Webhook` fÃ¶r :guilabel:`Push events`-hÃ¤ndelsen med destinationen ``/hooks/gitea/`` URL pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/gitea/``). Detta kan gÃ¶ras i :guilabel:`Webhooks` under :guilabel:`Settings` fÃ¶r repositoriet.

source: `Webhooks in Gitea manual <https://docs.gitea.io/en-us/webhooks/>`_
sv: `Webhooks i Gitea-manualen <https://docs.gitea.io/en-us/webhooks/>`_

source: Automatically receiving changes from Gitee Repos
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n Gitee Repos

source: Weblate has support for Gitee webhooks, add a :guilabel:`WebHook` for :guilabel:`Push` event with destination to ``/hooks/gitee/`` URL on your Weblate installation (for example ``https://hosted.weblate.org/hooks/gitee/``). This can be done in :guilabel:`WebHooks` under repository :guilabel:`Management`.
sv: Weblate har stÃ¶d fÃ¶r Gitee-webhooks. LÃ¤gg till en :guilabel:`WebHook` fÃ¶r :guilabel:`Push`-hÃ¤ndelse med destinationen ``/hooks/gitee/`` URL pÃ¥ din Weblate-installation (till exempel ``https://hosted.weblate.org/hooks/gitee/``). Detta kan gÃ¶ras i :guilabel:`WebHooks` under :guilabel:`Management` i arkivet.

source: `Webhooks in Gitee manual <https://gitee.com/help/categories/40>`_
sv: `Webhooks i Gitee-manualen <https://gitee.com/help/categories/40>`_

source: Automatically updating repositories nightly
sv: Automatisk uppdatering av arkiv varje natt

source: Weblate automatically fetches remote repositories nightly to improve performance when merging changes later. You can optionally turn this into doing nightly merges as well, by enabling :setting:`AUTO_UPDATE`.
sv: Weblate hÃ¤mtar automatiskt fjÃ¤rrlagringsplatser varje natt fÃ¶r att fÃ¶rbÃ¤ttra prestandan nÃ¤r Ã¤ndringar senare slÃ¥s samman. Du kan ocksÃ¥ vÃ¤lja att gÃ¶ra detta till nattliga sammanslagningar genom att aktivera :setting:`AUTO_UPDATE`.

source: Pushing changes from Weblate
sv: Skicka Ã¤ndringar frÃ¥n Weblate

source: Each translation component can have a push URL set up (see :ref:`component-push`), and in that case Weblate will be able to push change to the remote repository. Weblate can be also be configured to automatically push changes on every commit (this is default, see :ref:`component-push_on_commit`). If you do not want changes to be pushed automatically, you can do that manually under :guilabel:`Repository maintenance` or using the API via :option:`wlc push`.
sv: Varje Ã¶versÃ¤ttningskomponent kan ha en push-URL instÃ¤lld (se :ref:`component-push`), och i sÃ¥ fall kan Weblate skicka Ã¤ndringar till det fjÃ¤rranslutna arkivet. Weblate kan ocksÃ¥ konfigureras fÃ¶r att automatiskt Ã¶verfÃ¶ra Ã¤ndringar vid varje commit (detta Ã¤r standard, se :ref:`component-push_on_commit`). Om du inte vill att Ã¤ndringar ska Ã¶verfÃ¶ras automatiskt kan du gÃ¶ra det manuellt under :guilabel:`Repository maintenance` eller med hjÃ¤lp av API:et via :option:`wlc push`.

source: The push options differ based on the :ref:`vcs` used, more details are found in that chapter.
sv: Push-alternativen skiljer sig Ã¥t beroende pÃ¥ vilken :ref:`vcs` som anvÃ¤nds. Mer information finns i det kapitlet.

source: Overall, following options are available with Git, Mercurial, GitHub, GitLab, Gitea, Pagure, Azure DevOps, Bitbucket Data Center and Bitbucket Cloud:
sv: Sammantaget finns fÃ¶ljande alternativ tillgÃ¤ngliga med Git, Mercurial, GitHub, GitLab, Gitea, Pagure, Azure DevOps, Bitbucket Data Center och Bitbucket Cloud:

source: Desired setup
sv: Ãnskad instÃ¤llning

source: No push
sv: Ingen push

source: `empty`
sv: `tom`

source: Push directly
sv: Tryck direkt

source: SSH URL
sv: URL fÃ¶r SSH

source: Push to separate branch
sv: Tryck fÃ¶r att separera gren

source: GitHub pull request from fork
sv: GitHub-pullfÃ¶rfrÃ¥gan frÃ¥n fork

source: GitHub pull request from branch
sv: GitHub-pullfÃ¶rfrÃ¥gan frÃ¥n gren

source: GitLab merge request from fork
sv: GitLab-sammanslagningsfÃ¶rfrÃ¥gan frÃ¥n fork

source: GitLab merge request from branch
sv: GitLab-sammanslagningsbegÃ¤ran frÃ¥n gren

source: Gitea merge request from fork
sv: Gitea-sammanslagningsfÃ¶rfrÃ¥gan frÃ¥n fork

source: Gitea merge request from branch
sv: Gitea-sammanslagningsbegÃ¤ran frÃ¥n gren

source: Pagure merge request from fork
sv: Pagure-sammanslagningsfÃ¶rfrÃ¥gan frÃ¥n fork

source: Pagure merge request from branch
sv: Pagure-sammanslagningsbegÃ¤ran frÃ¥n gren

source: Azure DevOps pull request from fork
sv: Azure DevOps pull-fÃ¶rfrÃ¥gan frÃ¥n fork

source: Azure DevOps pull request from branch
sv: Azure DevOps pull-fÃ¶rfrÃ¥gan frÃ¥n gren

source: Bitbucket Data Center pull request from fork
sv: Bitbucket Data Center pull-begÃ¤ran frÃ¥n fork

source: Bitbucket Data Center pull request from branch
sv: Bitbucket Data Center pull-fÃ¶rfrÃ¥gan frÃ¥n gren

source: Bitbucket Cloud pull request from fork
sv: Bitbucket Cloud-pullfÃ¶rfrÃ¥gan frÃ¥n fork

source: Bitbucket Cloud pull request from branch
sv: Bitbucket Cloud-pullfÃ¶rfrÃ¥gan frÃ¥n gren

source: Can be empty in case :ref:`component-repo` supports pushing.
sv: Kan vara tomt om :ref:`component-repo` stÃ¶der pushning.

source: You can also enable automatic pushing of changes after Weblate commits, this can be done in :ref:`component-push_on_commit`.
sv: Du kan ocksÃ¥ aktivera automatisk Ã¶verfÃ¶ring av Ã¤ndringar efter Weblate-commits. Detta kan gÃ¶ras i :ref:`component-push_on_commit`.

source: See :ref:`vcs-repos` for setting up SSH keys, and :ref:`lazy-commit` for info about when Weblate decides to commit changes.
sv: Se :ref:`vcs-repos` fÃ¶r att konfigurera SSH-nycklar och :ref:`lazy-commit` fÃ¶r information om nÃ¤r Weblate beslutar att bekrÃ¤fta Ã¤ndringar.

source: Protected branches
sv: Skyddade grenar

source: If you are using Weblate on protected branch, you can configure it to use pull requests and perform actual review on the translations (what might be problematic for languages you do not know). An alternative approach is to waive this limitation for the Weblate push user.
sv: Om du anvÃ¤nder Weblate pÃ¥ en skyddad gren kan du konfigurera den sÃ¥ att den anvÃ¤nder pull-fÃ¶rfrÃ¥gningar och utfÃ¶r en faktisk granskning av Ã¶versÃ¤ttningarna (vilket kan vara problematiskt fÃ¶r sprÃ¥k du inte kan). Ett alternativ Ã¤r att upphÃ¤va denna begrÃ¤nsning fÃ¶r Weblate-pushanvÃ¤ndaren.

source: For example on GitHub this can be done in the repository configuration:
sv: PÃ¥ GitHub kan detta till exempel gÃ¶ras i repositoriekontrollen:

source: Interacting with others
sv: Interagera med andra

source: Weblate makes it easy to interact with others using its API.
sv: Weblate gÃ¶r det enkelt att interagera med andra med hjÃ¤lp av dess API.

source: Lazy commits
sv: Lata Ã¥taganden

source: The behaviour of Weblate is to group commits from the same author into one commit if possible. This greatly reduces the number of commits, however you might need to explicitly tell it to do the commits in case you want to get the VCS repository in sync, e.g. for merge (this is by default allowed for the :guilabel:`Managers` group, see :ref:`privileges`).
sv: Weblate grupperar om mÃ¶jligt alla commit frÃ¥n samma fÃ¶rfattare till en enda commit. Detta minskar antalet commit avsevÃ¤rt, men du kan behÃ¶va ange uttryckligen att commit ska gÃ¶ras om du vill synkronisera VCS-arkivet, t.ex. fÃ¶r sammanslagning (detta Ã¤r som standard tillÃ¥tet fÃ¶r gruppen :guilabel:`Managers`, se :ref:`privileges`).

source: The changes in this mode are committed once any of the following conditions are fulfilled:
sv: Ãndringarna i detta lÃ¤ge bekrÃ¤ftas nÃ¤r nÃ¥got av fÃ¶ljande villkor Ã¤r uppfyllt:

source: Somebody else changes an already changed string.
sv: NÃ¥gon annan Ã¤ndrar en redan Ã¤ndrad strÃ¤ng.

source: A merge from upstream occurs.
sv: En sammanslagning frÃ¥n uppstrÃ¶ms sker.

source: An explicit commit is requested.
sv: En uttrycklig bekrÃ¤ftelse krÃ¤vs.

source: A file download is requested.
sv: En filnedladdning begÃ¤rs.

source: Change is older than period defined as :ref:`component-commit_pending_age` on :ref:`component`.
sv: Ãndringen Ã¤r Ã¤ldre Ã¤n den period som definieras som :ref:`component-commit_pending_age` pÃ¥ :ref:`component`.

source: Commits are created for every component. So in case you have many components you will still see lot of commits. You might utilize :ref:`addon-weblate.git.squash` add-on in that case.
sv: Commits skapas fÃ¶r varje komponent. Om du har mÃ¥nga komponenter kommer du alltsÃ¥ fortfarande att se mÃ¥nga commits. I sÃ¥ fall kan du anvÃ¤nda tillÃ¤gget :ref:`addon-weblate.git.squash`.

source: If you want to commit changes more frequently and without checking of age, you can schedule a regular task to perform a commit. This can be done using :guilabel:`Periodic Tasks` in :ref:`admin-interface`. First create desired :guilabel:`Interval` (for example 120 seconds). Then add new periodic task and choose ``weblate.trans.tasks.commit_pending`` as :guilabel:`Task` with ``{"hours": 0}`` as :guilabel:`Keyword Arguments` and desired interval.
sv: Om du vill gÃ¶ra Ã¤ndringar oftare och utan att kontrollera Ã¥ldern kan du schemalÃ¤gga en regelbunden uppgift fÃ¶r att utfÃ¶ra en commit. Detta kan gÃ¶ras med hjÃ¤lp av :guilabel:`Periodiska uppgifter` i :ref:`admin-interface`. Skapa fÃ¶rst Ã¶nskat :guilabel:`Intervall` (till exempel 120 sekunder). LÃ¤gg sedan till en ny periodisk uppgift och vÃ¤lj ``weblate.trans.tasks.commit_pending`` som :guilabel:`Uppgift` med ``{"hours": 0}`` som :guilabel:`Nyckelordsargument` och Ã¶nskat intervall.

source: Processing repository with scripts
sv: Bearbetning av arkiv med skript

source: The way to customize how Weblate interacts with the repository is :ref:`addons`. Consult :ref:`addon-script` for info on how to execute external scripts through add-ons.
sv: Du kan anpassa hur Weblate interagerar med arkivet med hjÃ¤lp av :ref:`addons`. Se :ref:`addon-script` fÃ¶r information om hur du kÃ¶r externa skript via tillÃ¤gg.

source: Keeping translations same across components
sv: HÃ¥lla Ã¶versÃ¤ttningarna lika mellan komponenterna

source: Once you have multiple translation components, you might want to ensure that the same strings have same translation. This can be achieved at several levels.
sv: NÃ¤r du har flera Ã¶versÃ¤ttningskomponenter kan det vara bra att se till att samma strÃ¤ngar har samma Ã¶versÃ¤ttning. Detta kan uppnÃ¥s pÃ¥ flera nivÃ¥er.

source: Translation propagation
sv: ÃversÃ¤ttningsspridning

source: With :ref:`component-allow_translation_propagation` enabled (what is the default, see :ref:`component`), all new translations are automatically done in all components with matching strings. Such translations are properly credited to currently translating user in all components.
sv: Med :ref:`component-allow_translation_propagation` aktiverat (vilket Ã¤r standard, se :ref:`component`) gÃ¶rs alla nya Ã¶versÃ¤ttningar automatiskt i alla komponenter med matchande strÃ¤ngar. SÃ¥dana Ã¶versÃ¤ttningar krediteras korrekt till den anvÃ¤ndare som fÃ¶r nÃ¤rvarande Ã¶versÃ¤tter i alla komponenter.

source: Propagation preconditions:
sv: FÃ¶rutsÃ¤ttningar fÃ¶r spridning:

source: All components have to reside in a single project (linking component is not enough).
sv: Alla komponenter mÃ¥ste finnas i ett enda projekt (det rÃ¤cker inte med att lÃ¤nka komponenter).

source: Enable :ref:`component-allow_translation_propagation` to automatically reuse translations for matching strings.
sv: Aktivera :ref:`component-allow_translation_propagation` fÃ¶r att automatiskt Ã¥teranvÃ¤nda Ã¶versÃ¤ttningar fÃ¶r matchande strÃ¤ngar.

source: The translation propagation requires the key to be match for monolingual translation formats, so keep that in mind when creating translation keys.
sv: ÃversÃ¤ttningsspridningen krÃ¤ver att nyckeln matchar ensprÃ¥kiga Ã¶versÃ¤ttningsformat, sÃ¥ tÃ¤nk pÃ¥ det nÃ¤r du skapar Ã¶versÃ¤ttningsnycklar.

source: The strings are propagated while translating, strings loaded from the repository are not propagated.
sv: StrÃ¤ngarna sprids under Ã¶versÃ¤ttningen, men strÃ¤ngar som laddas frÃ¥n arkivet sprids inte.

source: This feature currently has limitations, and we want to make it more universal. Please share your feedback at https://github.com/WeblateOrg/weblate/issues/3166.
sv: Denna funktion har fÃ¶r nÃ¤rvarande begrÃ¤nsningar, och vi vill gÃ¶ra den mer universell. VÃ¤nligen dela med dig av dina synpunkter pÃ¥ https://github.com/WeblateOrg/weblate/issues/3166.

source: Consistency check
sv: Konsistenskontroll

source: The :ref:`check-inconsistent` check fires whenever the strings are different. You can utilize this to review such differences manually and choose the right translation.
sv: Kontrollen :ref:`check-inconsistent` utlÃ¶ses nÃ¤r strÃ¤ngarna skiljer sig Ã¥t. Du kan anvÃ¤nda detta fÃ¶r att manuellt granska sÃ¥dana skillnader och vÃ¤lja rÃ¤tt Ã¶versÃ¤ttning.

source: Automatic translation based on different components can be way to synchronize the translations across components. You can either trigger it manually (see :ref:`auto-translation`) or make it run automatically on repository update using add-on (see :ref:`addon-weblate.autotranslate.autotranslate`).
sv: Automatisk Ã¶versÃ¤ttning baserad pÃ¥ olika komponenter kan vara ett sÃ¤tt att synkronisera Ã¶versÃ¤ttningarna mellan komponenterna. Du kan antingen starta den manuellt (se :ref:`auto-translation`) eller lÃ¥ta den kÃ¶ras automatiskt vid uppdatering av arkivet med hjÃ¤lp av ett tillÃ¤gg (se :ref:`addon-weblate.autotranslate.autotranslate`).

source: Customizing Weblate
sv: Anpassa Weblate

source: Extend and customize using Django and Python. Contribute your changes upstream so that everybody can benefit. This reduces your maintenance costs; code in Weblate is taken care of when changing internal interfaces or refactoring the code.
sv: UtÃ¶ka och anpassa med hjÃ¤lp av Django och Python. Bidra med dina Ã¤ndringar uppstrÃ¶ms sÃ¥ att alla kan dra nytta av dem. Detta minskar dina underhÃ¥llskostnader; koden i Weblate tas om hand nÃ¤r interna grÃ¤nssnitt Ã¤ndras eller koden omarbetas.

source: You can also customize Weblate look in :ref:`manage-appearance`.
sv: Du kan ocksÃ¥ anpassa Weblates utseende i :ref:`manage-appearance`.

source: Neither internal interfaces nor templates are considered a stable API. Please review your customizations for every upgrade, the interfaces or their semantics might change without notice.
sv: Varken interna grÃ¤nssnitt eller mallar betraktas som ett stabilt API. Kontrollera dina anpassningar vid varje uppgradering, eftersom grÃ¤nssnitten eller deras semantik kan Ã¤ndras utan fÃ¶regÃ¥ende meddelande.

source: Creating a Python module
sv: Skapa en Python-modul

source: If you are not familiar with Python, you might want to look into `Python For Beginners <https://www.python.org/about/gettingstarted/>`_, explaining the basics and pointing to further tutorials.
sv: Om du inte Ã¤r bekant med Python kan du titta pÃ¥ `Python fÃ¶r nybÃ¶rjare <https://www.python.org/about/gettingstarted/>`_, som fÃ¶rklarar grunderna och hÃ¤nvisar till ytterligare handledningar.

source: To write a file with custom Python code (called a module), a place to store it is needed, either in the system path (usually something like :file:`/usr/lib/python3.12/site-packages/`) or in the Weblate directory, which is also added to the interpreter search path.
sv: FÃ¶r att skriva en fil med anpassad Python-kod (kallad modul) behÃ¶vs en plats att lagra den, antingen i systemvÃ¤gen (vanligtvis nÃ¥got i stil med :file:`/usr/lib/python3.12/site-packages/`) eller i Weblate-katalogen, som ocksÃ¥ lÃ¤ggs till i tolkens sÃ¶kvÃ¤g.

source: When :ref:`using Docker <docker-deploy>`, you can place Python modules in :file:`/app/data/python/` (see :ref:`docker-volume`), so they can be loaded by Weblate, for example from a :ref:`settings override file <docker-settings-override>`.
sv: NÃ¤r du :ref:`anvÃ¤nder Docker <docker-deploy>` kan du placera Python-moduler i :file:`/app/data/python/` (se :ref:`docker-volume`), sÃ¥ att de kan laddas av Weblate, till exempel frÃ¥n en :ref:`instÃ¤llningsÃ¶verskrivningsfil <docker-settings-override>`.

source: Better yet, turn your customization into a proper Python package:
sv: Ãnnu bÃ¤ttre, gÃ¶r din anpassning till ett riktigt Python-paket:

source: Create a folder for your package (we will use `weblate_customization`).
sv: Skapa en mapp fÃ¶r ditt paket (vi anvÃ¤nder `weblate_customization`).

source: Within it, create a :file:`pyproject.toml` file to describe the package:
sv: Inom den skapar du en :file:`pyproject.toml`-fil fÃ¶r att beskriva paketet:

source: Create a folder for the Python module: :file:`src/weblate_customization`
sv: Skapa en mapp fÃ¶r Python-modulen: :file:`src/weblate_customization`

source: Within it, create a :file:`__init__.py` file to ensure Python can import the module.
sv: Inom den skapar du en :file:`__init__.py`-fil fÃ¶r att sÃ¤kerstÃ¤lla att Python kan importera modulen.

source: This package can now be installed using :command:`uv pip install -e`. More info to be found in `Editable packages documentation`_.
sv: Detta paket kan nu installeras med :command:`uv pip install -e`. Mer information finns i `Dokumentation om redigerbara paket`_.

source: Once installed, the module can be used in the Weblate configuration (for example ``weblate_customization.checks.FooCheck``).
sv: NÃ¤r modulen har installerats kan den anvÃ¤ndas i Weblate-konfigurationen (till exempel ``weblate_customization.checks.FooCheck``).

source: Your package structure should look like this:
sv: Din paketstruktur bÃ¶r se ut sÃ¥ hÃ¤r:

source: You can find an example of customizing Weblate at <https://github.com/WeblateOrg/customize-example>, it covers all the topics described below.
sv: Du kan hitta ett exempel pÃ¥ hur man anpassar Weblate pÃ¥ <https://github.com/WeblateOrg/customize-example>. Det tÃ¤cker alla Ã¤mnen som beskrivs nedan.

source: Changing the logo
sv: Ãndra logotypen

source: Create a simple Django app containing the static files you want to overwrite (see :ref:`custom-module`).
sv: Skapa en enkel Django-app som innehÃ¥ller de statiska filer du vill skriva Ã¶ver (se :ref:`custom-module`).

source: Branding appears in the following files:
sv: VarumÃ¤rket fÃ¶rekommer i fÃ¶ljande filer:

source: Logo shown in the navigation bar.
sv: Logotyp som visas i navigeringsfÃ¤ltet.

source: Web icons depending on screen resolution and web-browser.
sv: Webbikoner beroende pÃ¥ skÃ¤rmupplÃ¶sning och webblÃ¤sare.

source: Web icon used by legacy browsers.
sv: Webbikon som anvÃ¤nds av Ã¤ldre webblÃ¤sare.

source: Avatars for bots or anonymous users. Some web-browsers use these as shortcut icons.
sv: Avatarer fÃ¶r bots eller anonyma anvÃ¤ndare. Vissa webblÃ¤sare anvÃ¤nder dessa som genvÃ¤gsikoner.

source: Used in notifications e-mails.
sv: AnvÃ¤nds i e-postmeddelanden med aviseringar.

source: Add it to :setting:`django:INSTALLED_APPS`:
sv: LÃ¤gg till det i :setting:`django:INSTALLED_APPS`:

source: Run :samp:`weblate collectstatic --noinput`, to collect static files served to clients.
sv: KÃ¶r :samp:`weblate collectstatic --noinput` fÃ¶r att samla in statiska filer som levereras till klienter.
